---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayPresetIndex
source: html/5926c93c-cb25-fe45-570e-62af68ae21b5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayPresetIndex Property

"Multi-day presets combo"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyMultidayPresetIndex { get; }
```